Revit 2027 API
BuiltInFailures.ElectricalFailures.NotEnoughRoomForParallelConduits Property
 Due to changes in elevation, there is not enough room to generate all of the parallel conduits. As a result, some conduit segments have not been generated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughRoomForParallelConduits { get; }
Public Shared ReadOnly Property NotEnoughRoomForParallelConduits As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughRoomForParallelConduits {
	FailureDefinitionId^ get ();
}
static member NotEnoughRoomForParallelConduits : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace